7767517
103 117
Input                    input                    0 1 input
Convolution              241                      1 1 input 248 0=16 1=3 4=1 5=1 6=432 8=2 9=6 -23310=2,1.666667e-01,5.000000e-01
Split                    splitncnn_0              1 2 248 248_splitncnn_0 248_splitncnn_1
Convolution              249                      1 1 248_splitncnn_1 251 0=16 1=1 5=1 6=256 8=102 9=1
ConvolutionDepthWise     252                      1 1 251 254 0=16 1=3 4=1 5=1 6=144 7=16 8=101 9=1
Convolution              255                      1 1 254 255 0=16 1=1 5=1 6=256 8=2
BinaryOp                 257                      2 1 248_splitncnn_0 255 257
Convolution              258                      1 1 257 260 0=64 1=1 5=1 6=1024 8=102 9=1
ConvolutionDepthWise     261                      1 1 260 263 0=64 1=3 3=2 4=1 5=1 6=576 7=64 8=101 9=1
Convolution              264                      1 1 263 264 0=24 1=1 5=1 6=1536 8=2
Split                    splitncnn_1              1 2 264 264_splitncnn_0 264_splitncnn_1
Convolution              266                      1 1 264_splitncnn_1 268 0=72 1=1 5=1 6=1728 8=102 9=1
ConvolutionDepthWise     269                      1 1 268 271 0=72 1=3 4=1 5=1 6=648 7=72 8=101 9=1
Convolution              272                      1 1 271 272 0=24 1=1 5=1 6=1728 8=2
BinaryOp                 274                      2 1 264_splitncnn_0 272 274
Convolution              275                      1 1 274 277 0=72 1=1 5=1 6=1728 8=102 9=1
ConvolutionDepthWise     278                      1 1 277 278 0=72 1=5 3=2 4=2 5=1 6=1800 7=72 8=1
Split                    splitncnn_2              1 2 278 278_splitncnn_0 278_splitncnn_1
Pooling                  286                      1 1 278_splitncnn_1 290 0=1 4=1
InnerProduct             292                      1 1 290 293 0=18 2=1296 8=2 9=1
InnerProduct             295                      1 1 293 295 0=72 2=1296 8=2
HardSigmoid              300                      1 1 295 300 0=1.666667e-01
BinaryOp                 309                      2 1 278_splitncnn_0 300 309 0=2
ReLU                     310                      1 1 309 310
Convolution              311                      1 1 310 311 0=40 1=1 5=1 6=2880 8=2
Split                    splitncnn_3              1 2 311 311_splitncnn_0 311_splitncnn_1
Convolution              313                      1 1 311_splitncnn_1 315 0=120 1=1 5=1 6=4800 8=102 9=1
ConvolutionDepthWise     316                      1 1 315 316 0=120 1=5 4=2 5=1 6=3000 7=120 8=1
Split                    splitncnn_4              1 2 316 316_splitncnn_0 316_splitncnn_1
Pooling                  324                      1 1 316_splitncnn_1 328 0=1 4=1
InnerProduct             330                      1 1 328 331 0=30 2=3600 8=2 9=1
InnerProduct             333                      1 1 331 333 0=120 2=3600 8=2
HardSigmoid              338                      1 1 333 338 0=1.666667e-01
BinaryOp                 347                      2 1 316_splitncnn_0 338 347 0=2
ReLU                     348                      1 1 347 348
Convolution              349                      1 1 348 349 0=40 1=1 5=1 6=4800 8=2
BinaryOp                 351                      2 1 311_splitncnn_0 349 351
Split                    splitncnn_5              1 2 351 351_splitncnn_0 351_splitncnn_1
Convolution              352                      1 1 351_splitncnn_1 354 0=120 1=1 5=1 6=4800 8=102 9=1
ConvolutionDepthWise     355                      1 1 354 355 0=120 1=5 4=2 5=1 6=3000 7=120 8=1
Split                    splitncnn_6              1 2 355 355_splitncnn_0 355_splitncnn_1
Pooling                  363                      1 1 355_splitncnn_1 367 0=1 4=1
InnerProduct             369                      1 1 367 370 0=30 2=3600 8=2 9=1
InnerProduct             372                      1 1 370 372 0=120 2=3600 8=2
HardSigmoid              377                      1 1 372 377 0=1.666667e-01
BinaryOp                 386                      2 1 355_splitncnn_0 377 386 0=2
ReLU                     387                      1 1 386 387
Convolution              388                      1 1 387 388 0=40 1=1 5=1 6=4800 8=2
BinaryOp                 output1                  2 1 351_splitncnn_0 388 output1
Convolution              391                      1 1 output1 393 0=240 1=1 5=1 6=9600 8=102 9=1
ConvolutionDepthWise     394                      1 1 393 396 0=240 1=3 3=2 4=1 5=1 6=2160 7=240 8=101 9=1
Convolution              397                      1 1 396 397 0=80 1=1 5=1 6=19200 8=2
Split                    splitncnn_7              1 2 397 397_splitncnn_0 397_splitncnn_1
Convolution              399                      1 1 397_splitncnn_1 406 0=200 1=1 5=1 6=16000 8=102 9=6 -23310=2,1.666667e-01,5.000000e-01
ConvolutionDepthWise     407                      1 1 406 414 0=200 1=3 4=1 5=1 6=1800 7=200 8=101 9=6 -23310=2,1.666667e-01,5.000000e-01
Convolution              415                      1 1 414 415 0=80 1=1 5=1 6=16000 8=2
BinaryOp                 417                      2 1 397_splitncnn_0 415 417
Convolution              418                      1 1 417 425 0=480 1=1 5=1 6=38400 8=102 9=6 -23310=2,1.666667e-01,5.000000e-01
ConvolutionDepthWise     426                      1 1 425 426 0=480 1=3 4=1 5=1 6=4320 7=480 8=1
Split                    splitncnn_8              1 2 426 426_splitncnn_0 426_splitncnn_1
Pooling                  434                      1 1 426_splitncnn_1 438 0=1 4=1
InnerProduct             440                      1 1 438 441 0=120 2=57600 8=2 9=1
InnerProduct             443                      1 1 441 443 0=480 2=57600 8=2
HardSigmoid              448                      1 1 443 448 0=1.666667e-01
BinaryOp                 457                      2 1 426_splitncnn_0 448 457 0=2
HardSwish                463                      1 1 457 463 0=1.666667e-01
Convolution              464                      1 1 463 464 0=112 1=1 5=1 6=53760 8=2
Split                    splitncnn_9              1 2 464 464_splitncnn_0 464_splitncnn_1
Convolution              466                      1 1 464_splitncnn_1 473 0=672 1=1 5=1 6=75264 8=102 9=6 -23310=2,1.666667e-01,5.000000e-01
ConvolutionDepthWise     474                      1 1 473 474 0=672 1=3 4=1 5=1 6=6048 7=672 8=1
Split                    splitncnn_10             1 2 474 474_splitncnn_0 474_splitncnn_1
Pooling                  482                      1 1 474_splitncnn_1 486 0=1 4=1
InnerProduct             488                      1 1 486 489 0=168 2=112896 8=2 9=1
InnerProduct             491                      1 1 489 491 0=672 2=112896 8=2
HardSigmoid              496                      1 1 491 496 0=1.666667e-01
BinaryOp                 505                      2 1 474_splitncnn_0 496 505 0=2
HardSwish                511                      1 1 505 511 0=1.666667e-01
Convolution              512                      1 1 511 512 0=112 1=1 5=1 6=75264 8=2
BinaryOp                 514                      2 1 464_splitncnn_0 512 514
Convolution              515                      1 1 514 522 0=672 1=1 5=1 6=75264 8=102 9=6 -23310=2,1.666667e-01,5.000000e-01
ConvolutionDepthWise     523                      1 1 522 523 0=672 1=3 4=1 5=1 6=6048 7=672 8=1
Split                    splitncnn_11             1 2 523 523_splitncnn_0 523_splitncnn_1
Pooling                  531                      1 1 523_splitncnn_1 535 0=1 4=1
InnerProduct             537                      1 1 535 538 0=168 2=112896 8=2 9=1
InnerProduct             540                      1 1 538 540 0=672 2=112896 8=2
HardSigmoid              545                      1 1 540 545 0=1.666667e-01
BinaryOp                 554                      2 1 523_splitncnn_0 545 554 0=2
HardSwish                560                      1 1 554 560 0=1.666667e-01
Convolution              561                      1 1 560 561 0=160 1=1 5=1 6=107520 8=102
Convolution              563                      1 1 561 570 0=320 1=1 5=1 6=51200 8=102 9=6 -23310=2,1.666667e-01,5.000000e-01
ConvolutionDepthWise     571                      1 1 570 578 0=320 1=3 4=1 5=1 6=2880 7=320 8=101 9=6 -23310=2,1.666667e-01,5.000000e-01
Convolution              579                      1 1 578 579 0=16 1=1 5=1 6=5120 8=2
Split                    splitncnn_12             1 2 579 579_splitncnn_0 579_splitncnn_1
Pooling                  582                      1 1 579_splitncnn_1 582 0=1 1=14 2=14 5=1
Reshape                  590                      1 1 582 590 0=-1
Convolution              591                      1 1 579_splitncnn_0 591 0=32 1=3 3=2 4=1 5=1 6=4608 8=2
Split                    splitncnn_13             1 2 591 591_splitncnn_0 591_splitncnn_1
Pooling                  593                      1 1 591_splitncnn_1 593 0=1 1=7 2=7 5=1
Reshape                  601                      1 1 593 601 0=-1
Convolution              602                      1 1 591_splitncnn_0 602 0=128 1=7 5=1 6=200704 8=2
Reshape                  610                      1 1 602 610 0=-1
Concat                   611                      3 1 590 601 610 611
InnerProduct             output                   1 1 611 output 0=212 1=1 2=37312 8=2
